turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A4C.atdf
        <module name="CAN" version="6019N">
          <instance name="CAN0">
            <register-group address-space="base" name="CAN0" name-in-module="CAN" offset="0x400B4000"/>
            <signals>
              <signal pad="PA1" function="A" group="CANRX" index="0"/>
              <signal pad="PA0" function="A" group="CANTX" index="0"/>
            </signals>
          </instance>
          <instance name="CAN1">
            <register-group address-space="base" name="CAN1" name-in-module="CAN" offset="0x400B8000"/>
            <signals>
              <signal pad="PB15" function="A" group="CANRX" index="1"/>
              <signal pad="PB14" function="A" group="CANTX" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" version="6417R">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0940"/>
          </instance>
        </module>
        <module name="DACC" version="6461F">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x400C8000"/>
            <signals>
              <signal pad="PB15" function="X1" group="DAC" index="0"/>
              <signal pad="PB15" function="X1" group="WKUP" index="12"/>
              <signal pad="PB16" function="X1" group="DAC" index="1"/>
              <signal pad="PA10" function="B" group="DATRG"/>
            </signals>
          </instance>
        </module>
        <module name="DMAC" version="6233P">
          <instance name="DMAC">
            <register-group address-space="base" name="DMAC" name-in-module="DMAC" offset="0x400C4000"/>
          </instance>
        </module>
        <module name="EFC" version="6450J">
          <instance name="EFC0">
            <register-group address-space="base" name="EFC0" name-in-module="EFC" offset="0x400E0A00"/>
            <parameters>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="256"/>
              <param name="PAGES_PR_REGION" value="64"/>
            </parameters>
          </instance>
          <instance name="EFC1">
            <register-group address-space="base" name="EFC1" name-in-module="EFC" offset="0x400E0C00"/>
            <parameters>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="256"/>
              <param name="PAGES_PR_REGION" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" version="6378D">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1A90"/>
          </instance>
        </module>
        <module name="HSMCI" version="6449O">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40000000"/>
            <signals>
              <signal pad="PA20" function="A" group="MCCDA"/>
              <signal pad="PE20" function="B" group="MCCDB"/>
              <signal pad="PA19" function="A" group="MCCK"/>
              <signal pad="PA21" function="A" group="MCDA" index="0"/>
              <signal pad="PA22" function="A" group="MCDA" index="1"/>
              <signal pad="PA23" function="A" group="MCDA" index="2"/>
              <signal pad="PA24" function="A" group="MCDA" index="3"/>
              <signal pad="PD0" function="B" group="MCDA" index="4"/>
              <signal pad="PD1" function="B" group="MCDA" index="5"/>
              <signal pad="PD2" function="B" group="MCDA" index="6"/>
              <signal pad="PD3" function="B" group="MCDA" index="7"/>
              <signal pad="PE22" function="B" group="MCDB" index="0"/>
              <signal pad="PE24" function="B" group="MCDB" index="1"/>
              <signal pad="PE26" function="B" group="MCDB" index="2"/>
              <signal pad="PE27" function="B" group="MCDB" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="MATRIX" version="11060A">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0400"/>
          </instance>
        </module>
        <module name="PIO" version="6315C">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          </instance>
        </module>
        <module name="PMC" version="11116I">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0600"/>
            <signals>
              <signal pad="PA1" function="B" group="PCK" index="0"/>
              <signal pad="PB22" function="B" group="PCK" index="0"/>
              <signal pad="PA24" function="B" group="PCK" index="1"/>
              <signal pad="PA30" function="B" group="PCK" index="1"/>
              <signal pad="PA28" function="B" group="PCK" index="2"/>
              <signal pad="PA31" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" version="6343J">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x40094000"/>
            <signals>
              <signal pad="PA5" function="B" group="PWMFI" index="0"/>
              <signal pad="PA3" function="B" group="PWMFI" index="1"/>
              <signal pad="PD6" function="B" group="PWMFI" index="2"/>
              <signal pad="PA8" function="B" group="PWMH" index="0"/>
              <signal pad="PB12" function="B" group="PWMH" index="0"/>
              <signal pad="PC3" function="B" group="PWMH" index="0"/>
              <signal pad="PE15" function="A" group="PWMH" index="0"/>
              <signal pad="PA19" function="B" group="PWMH" index="1"/>
              <signal pad="PB13" function="B" group="PWMH" index="1"/>
              <signal pad="PC5" function="B" group="PWMH" index="1"/>
              <signal pad="PE16" function="A" group="PWMH" index="1"/>
              <signal pad="PA13" function="B" group="PWMH" index="2"/>
              <signal pad="PB14" function="B" group="PWMH" index="2"/>
              <signal pad="PC7" function="B" group="PWMH" index="2"/>
              <signal pad="PA9" function="B" group="PWMH" index="3"/>
              <signal pad="PB15" function="B" group="PWMH" index="3"/>
              <signal pad="PC9" function="B" group="PWMH" index="3"/>
              <signal pad="PF3" function="A" group="PWMH" index="3"/>
              <signal pad="PC20" function="B" group="PWMH" index="4"/>
              <signal pad="PE20" function="A" group="PWMH" index="4"/>
              <signal pad="PC19" function="B" group="PWMH" index="5"/>
              <signal pad="PE22" function="A" group="PWMH" index="5"/>
              <signal pad="PC18" function="B" group="PWMH" index="6"/>
              <signal pad="PE24" function="A" group="PWMH" index="6"/>
              <signal pad="PE26" function="A" group="PWMH" index="7"/>
              <signal pad="PA21" function="B" group="PWML" index="0"/>
              <signal pad="PB16" function="B" group="PWML" index="0"/>
              <signal pad="PC2" function="B" group="PWML" index="0"/>
              <signal pad="PE18" function="A" group="PWML" index="0"/>
              <signal pad="PA12" function="B" group="PWML" index="1"/>
              <signal pad="PB17" function="B" group="PWML" index="1"/>
              <signal pad="PC4" function="B" group="PWML" index="1"/>
              <signal pad="PA20" function="B" group="PWML" index="2"/>
              <signal pad="PB18" function="B" group="PWML" index="2"/>
              <signal pad="PC6" function="B" group="PWML" index="2"/>
              <signal pad="PE17" function="A" group="PWML" index="2"/>
              <signal pad="PA0" function="B" group="PWML" index="3"/>
              <signal pad="PB19" function="B" group="PWML" index="3"/>
              <signal pad="PC8" function="B" group="PWML" index="3"/>
              <signal pad="PB6" function="B" group="PWML" index="4"/>
              <signal pad="PC21" function="B" group="PWML" index="4"/>
              <signal pad="PE19" function="A" group="PWML" index="4"/>
              <signal pad="PB7" function="B" group="PWML" index="5"/>
              <signal pad="PC22" function="B" group="PWML" index="5"/>
              <signal pad="PE21" function="A" group="PWML" index="5"/>
              <signal pad="PB8" function="B" group="PWML" index="6"/>
              <signal pad="PC23" function="B" group="PWML" index="6"/>
              <signal pad="PE23" function="A" group="PWML" index="6"/>
              <signal pad="PB9" function="B" group="PWML" index="7"/>
              <signal pad="PC24" function="B" group="PWML" index="7"/>
              <signal pad="PE25" function="A" group="PWML" index="7"/>
            </signals>
          </instance>
        </module>
