turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A4C.atdf
        <register caption="Timer Register" name="CAN_TIM" offset="0x0018" rw="R" size="4">
          <bitfield caption="Timer" mask="0x0000FFFF" name="TIMER"/>
        </register>
        <register caption="Timestamp Register" name="CAN_TIMESTP" offset="0x001C" rw="R" size="4">
          <bitfield caption="Timestamp" mask="0x0000FFFF" name="MTIMESTAMP"/>
        </register>
        <register caption="Error Counter Register" name="CAN_ECR" offset="0x0020" rw="R" size="4">
          <bitfield caption="Receive Error Counter" mask="0x000000FF" name="REC"/>
          <bitfield caption="Transmit Error Counter" mask="0x00FF0000" name="TEC"/>
        </register>
        <register caption="Transfer Command Register" name="CAN_TCR" offset="0x0024" rw="W" size="4">
          <bitfield caption="Transfer Request for Mailbox 0" mask="0x00000001" name="MB0"/>
          <bitfield caption="Transfer Request for Mailbox 1" mask="0x00000002" name="MB1"/>
          <bitfield caption="Transfer Request for Mailbox 2" mask="0x00000004" name="MB2"/>
          <bitfield caption="Transfer Request for Mailbox 3" mask="0x00000008" name="MB3"/>
          <bitfield caption="Transfer Request for Mailbox 4" mask="0x00000010" name="MB4"/>
          <bitfield caption="Transfer Request for Mailbox 5" mask="0x00000020" name="MB5"/>
          <bitfield caption="Transfer Request for Mailbox 6" mask="0x00000040" name="MB6"/>
          <bitfield caption="Transfer Request for Mailbox 7" mask="0x00000080" name="MB7"/>
          <bitfield caption="Timer Reset" mask="0x80000000" name="TIMRST"/>
        </register>
        <register caption="Abort Command Register" name="CAN_ACR" offset="0x0028" rw="W" size="4">
          <bitfield caption="Abort Request for Mailbox 0" mask="0x00000001" name="MB0"/>
          <bitfield caption="Abort Request for Mailbox 1" mask="0x00000002" name="MB1"/>
          <bitfield caption="Abort Request for Mailbox 2" mask="0x00000004" name="MB2"/>
          <bitfield caption="Abort Request for Mailbox 3" mask="0x00000008" name="MB3"/>
          <bitfield caption="Abort Request for Mailbox 4" mask="0x00000010" name="MB4"/>
          <bitfield caption="Abort Request for Mailbox 5" mask="0x00000020" name="MB5"/>
          <bitfield caption="Abort Request for Mailbox 6" mask="0x00000040" name="MB6"/>
          <bitfield caption="Abort Request for Mailbox 7" mask="0x00000080" name="MB7"/>
        </register>
        <register caption="Write Protect Mode Register" name="CAN_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="SPI Write Protection Key Password" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="CAN_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
        <register caption="Mailbox Mode Register (MB = 0)" name="CAN_MMR0" offset="0x200" rw="RW" size="4">
          <bitfield caption="Mailbox Timemark" mask="0x0000FFFF" name="MTIMEMARK"/>
          <bitfield caption="Mailbox Priority" mask="0x000F0000" name="PRIOR"/>
          <bitfield caption="Mailbox Object Type" mask="0x07000000" name="MOT" values="CAN_MMR0__MOT"/>
        </register>
        <register caption="Mailbox Acceptance Mask Register (MB = 0)" name="CAN_MAM0" offset="0x204" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox ID Register (MB = 0)" name="CAN_MID0" offset="0x208" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox Family ID Register (MB = 0)" name="CAN_MFID0" offset="0x20C" rw="R" size="4">
          <bitfield caption="Family ID" mask="0x1FFFFFFF" name="MFID"/>
        </register>
        <register caption="Mailbox Status Register (MB = 0)" name="CAN_MSR0" offset="0x210" rw="R" size="4">
          <bitfield caption="Timer value" mask="0x0000FFFF" name="MTIMESTAMP"/>
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Mailbox Message Abort" mask="0x00400000" name="MABT"/>
          <bitfield caption="Mailbox Ready" mask="0x00800000" name="MRDY"/>
          <bitfield caption="Mailbox Message Ignored" mask="0x01000000" name="MMI"/>
        </register>
        <register caption="Mailbox Data Low Register (MB = 0)" name="CAN_MDL0" offset="0x214" rw="RW" size="4">
          <bitfield caption="Message Data Low Value" mask="0xFFFFFFFF" name="MDL"/>
        </register>
        <register caption="Mailbox Data High Register (MB = 0)" name="CAN_MDH0" offset="0x218" rw="RW" size="4">
          <bitfield caption="Message Data High Value" mask="0xFFFFFFFF" name="MDH"/>
        </register>
        <register caption="Mailbox Control Register (MB = 0)" name="CAN_MCR0" offset="0x21C" rw="W" size="4">
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Abort Request for Mailbox x" mask="0x00400000" name="MACR"/>
          <bitfield caption="Mailbox Transfer Command" mask="0x00800000" name="MTCR"/>
        </register>
        <register caption="Mailbox Mode Register (MB = 1)" name="CAN_MMR1" offset="0x220" rw="RW" size="4">
          <bitfield caption="Mailbox Timemark" mask="0x0000FFFF" name="MTIMEMARK"/>
          <bitfield caption="Mailbox Priority" mask="0x000F0000" name="PRIOR"/>
          <bitfield caption="Mailbox Object Type" mask="0x07000000" name="MOT" values="CAN_MMR1__MOT"/>
        </register>
