turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A4C.atdf
        <register caption="Host Pipe Configuration Register (n = 0) 3" name="UOTGHS_HSTPIPCFG3" offset="0x50C" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 4" name="UOTGHS_HSTPIPCFG4" offset="0x510" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 5" name="UOTGHS_HSTPIPCFG5" offset="0x514" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 6" name="UOTGHS_HSTPIPCFG6" offset="0x518" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 7" name="UOTGHS_HSTPIPCFG7" offset="0x51C" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 8" name="UOTGHS_HSTPIPCFG8" offset="0x520" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 9" name="UOTGHS_HSTPIPCFG9" offset="0x524" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
