turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A4C.atdf
        <register caption="Host Pipe Status Register (n = 0) 0" name="UOTGHS_HSTPIPISR0" offset="0x530" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 1" name="UOTGHS_HSTPIPISR1" offset="0x534" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 2" name="UOTGHS_HSTPIPISR2" offset="0x538" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 3" name="UOTGHS_HSTPIPISR3" offset="0x53C" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 4" name="UOTGHS_HSTPIPISR4" offset="0x540" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 5" name="UOTGHS_HSTPIPISR5" offset="0x544" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Status Register (n = 0) 6" name="UOTGHS_HSTPIPISR6" offset="0x548" rw="R" size="4">
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
